/**
*@file script
*@author Ivanenko Juliya
*/

var x = "images/x.gif";           //Место загрузки изображения x.gif сайта 
var o = "images/o.gif";           //Место загрузки изображения o.gif сайта 
var blank = "images/blank.jpg";   //Место загрузки изображения blank.gif сайта 

//Общие переменные
var pause = 0;             //Пауза
var all = 0;               //Все
var a = 0;                 //Позиция a
var b = 0;                 //Позиция b
var c = 0;                 //Позиция c
var d = 0;                 //Позиция d
var e = 0;                 //Позиция e
var f = 0;                 //Позиция f
var g = 0;                 //Позиция g
var h = 0;                 //Позиция h
var i = 0;                 //Позиция i
var temp = "";
var ok = 0;
var cf = 0;
var choice = 9;            //Переменная выбора позиции
var aRandomNumber = 0;
var comp = 0; 
var t = 0;
var wn = 0;                //Вы
var ls = 0;                //Компьютер
var ts = 0;                //Ничья

/**
* Функция логики один. 
* Если позиции поля по вертикалям, по горизонталям 
* и по диагонялям равны единице, то в переменную all 
* записываем один, если двойке - два. Если все позиции
* заполнены, но по либо по вертикалям, либо по горизонталям,
* либо по диагоналям нет всех нулей или всех единиц, 
* то записываем в переменную all 3 - ничья.
*/


function logicOne() {
    if ((a == 1) && (b == 1) && (c == 1)) all = 1;    //единицы в первой строке
    if ((a == 1) && (d == 1) && (g == 1)) all = 1;    //единицы в первом столбце
    if ((a == 1) && (e == 1) && (i == 1)) all = 1;    //единицы на первой диагонали
    if ((b == 1) && (e == 1) && (h == 1)) all = 1;    //единицы во втором столбце
    if ((d == 1) && (e == 1) && (f == 1)) all = 1;    //единицы во второй строке
    if ((g == 1) && (h == 1) && (i == 1)) all = 1;    //единицы в третьей строке
    if ((c == 1) && (f == 1) && (i == 1)) all = 1;    //единицы в третем столбце
    if ((g == 1) && (e == 1) && (c == 1)) all = 1;    //единицы на второй диагонали
    if ((a == 2) && (b == 2) && (c == 2)) all = 2;    //двойки в первой строке
    if ((a == 2) && (d == 2) && (g == 2)) all = 2;    //двойки в первом столбце
    if ((a == 2) && (e == 2) && (i == 2)) all = 2;    //двойки на первой диагонали
    if ((b == 2) && (e == 2) && (h == 2)) all = 2;    //двойки во втором столбце
    if ((d == 2) && (e == 2) && (f == 2)) all = 2;    //двойки во второй строке
    if ((g == 2) && (h == 2) && (i == 2)) all = 2;    //двойки в третьей строке
    if ((c == 2) && (f == 2) && (i == 2)) all = 2;    //двойки в третем столбце
    if ((g == 2) && (e == 2) && (c == 2)) all = 2;    //двойки на второй диагонали
    if ((a != 0) && (b != 0) && (c != 0) && (d != 0) && 
    (e != 0) && (f != 0) && (g != 0) && (h != 0) && (i != 0) && (all == 0)) all = 3;    //ничья
}
 
/**
* Функция логики два. Если две позиции на одной из вертикали,
* горизонтали или диагонали равны двойке, то в переменную temp 
* записываем имя оставшейся позиции.
*/
function logicTwo() {
    //незадействованная позиция в первой строке
    if ((a == 2) && (b == 2) && (c == 0) && (temp == "")) temp = "C";
    if ((a == 2) && (b == 0) && (c == 2) && (temp == "")) temp = "B";
    if ((a == 0) && (b == 2) && (c == 2) && (temp == "")) temp = "A";
    //незадействованная позиция в первом столбце
    if ((a == 2) && (d == 2) && (g == 0) && (temp == "")) temp = "G";
    if ((a == 2) && (d == 0) && (g == 2) && (temp == "")) temp = "D";
    if ((a == 0) && (d == 2) && (g == 2) && (temp == "")) temp = "A";
    //незадействованная позиция на первой диагонале
    if ((a == 2) && (e == 2) && (i == 0) && (temp == "")) temp = "I";
    if ((a == 2) && (e == 0) && (i == 2) && (temp == "")) temp = "E";
    if ((a == 0) && (e == 2) && (i == 2) && (temp == "")) temp = "A";
    //незадействованная позиция во втором столбце
    if ((b == 2) && (e == 2) && (h == 0) && (temp == "")) temp = "H";
    if ((b == 2) && (e == 0) && (h == 2) && (temp == "")) temp = "E";
    if ((b == 0) && (e == 2) && (h == 2) && (temp == "")) temp = "B";
    //незадействованная позиция во второй строке
    if ((d == 2) && (e == 2) && (f == 0) && (temp == "")) temp = "F";
    if ((d == 2) && (e == 0) && (f == 2) && (temp == "")) temp = "E";
    if ((d == 0) && (e == 2) && (f == 2) && (temp == "")) temp = "D";
    //незадействованная позиция в третьей строке
    if ((g == 2) && (h == 2) && (i == 0) && (temp == "")) temp = "I";
    if ((g == 2) && (h == 0) && (i == 2) && (temp == "")) temp = "H";
    if ((g == 0) && (h == 2) && (i == 2) && (temp == "")) temp = "G";
    //незадействованная позиция в третьем столбце
    if ((c == 2) && (f == 2) && (i == 0) && (temp == "")) temp = "I";
    if ((c == 2) && (f == 0) && (i == 2) && (temp == "")) temp = "F";
    if ((c == 0) && (f == 2) && (i == 2) && (temp == "")) temp = "C";
    //незадействованная позиция на второй диагонале
    if ((g == 2) && (e == 2) && (c == 0) && (temp == "")) temp = "C";
    if ((g == 2) && (e == 0) && (c == 2) && (temp == "")) temp = "E";
    if ((g == 0) && (e == 2) && (c == 2) && (temp == "")) temp = "G";
}

/**
* Функция логики три. Если две позиции на одной из вертикали,
* горизонтали или диагонали равны единице, то в переменную temp 
* записываем имя оставшейся позиции.
*/
function logicThree() {
    //незадействованная позиция в первой строке
    if ((a == 1) && (b == 1) && (c == 0) && (temp == "")) temp = "C";
    if ((a == 1) && (b == 0) && (c == 1) && (temp == "")) temp = "B";
    if ((a == 0) && (b == 1) && (c == 1) && (temp == "")) temp = "A";
    //незадействованная позиция в первом столбце
    if ((a == 1) && (d == 1) && (g == 0) && (temp == "")) temp = "G";
    if ((a == 1) && (d == 0) && (g == 1) && (temp == "")) temp = "D";
    if ((a == 0) && (d == 1) && (g == 1) && (temp == "")) temp = "A";
    //незадействованная позиция на первой диагонале
    if ((a == 1) && (e == 1) && (i == 0) && (temp == "")) temp = "I";
    if ((a == 1) && (e == 0) && (i == 1) && (temp == "")) temp = "E";
    if ((a == 0) && (e == 1) && (i == 1) && (temp == "")) temp = "A";
    //незадействованная позиция во втором столбце
    if ((b == 1) && (e == 1) && (h == 0) && (temp == "")) temp = "H";
    if ((b == 1) && (e == 0) && (h == 1) && (temp == "")) temp = "E";
    if ((b == 0) && (e == 1) && (h == 1) && (temp == "")) temp = "B";
    //незадействованная позиция во второй строке
    if ((d == 1) && (e == 1) && (f == 0) && (temp == "")) temp = "F";
    if ((d == 1) && (e == 0) && (f == 1) && (temp == "")) temp = "E";
    if ((d == 0) && (e == 1) && (f == 1) && (temp == "")) temp = "D";
    //незадействованная позиция в третьей строке
    if ((g == 1) && (h == 1) && (i == 0) && (temp == "")) temp = "I";
    if ((g == 1) && (h == 0) && (i == 1) && (temp == "")) temp = "H";
    if ((g == 0) && (h == 1) && (i == 1) && (temp == "")) temp = "G";
    //незадействованная позиция в третьем столбце
    if ((c == 1) && (f == 1) && (i == 0) && (temp == "")) temp = "I";
    if ((c == 1) && (f == 0) && (i == 1) && (temp == "")) temp = "F";
    if ((c == 0) && (f == 1) && (i == 1) && (temp == "")) temp = "C";
    //незадействованная позиция на второй диагонале
    if ((g == 1) && (e == 1) && (c == 0) && (temp == "")) temp = "C";
    if ((g == 1) && (e == 0) && (c == 1) && (temp == "")) temp = "E";
    if ((g == 0) && (e == 1) && (c == 1) && (temp == "")) temp = "G";
}

/**
* Функция-помощник. Вы играеете X, компьютер - O.
* Занятую площадь недьзя занять еще раз. Победит тот,
* кто первым заполнит три позиции по диагонали, вертикали 
* или горизонтали всеми X, либо всеми O.
*/
function MyHelp() {
    alert("Welcome to Tic-Tac-Toe!");
    alert("You play as the X's and the computer is the O's.");
    alert("Select the square you want to put your X into by clicking them.");
    alert("You cannot occupy a square that is already occupied."); 
    alert("The first player to get three squares in a row wins.  Good Luck!!");
}

/**
* Функция значения переменных you, computer, ties
*/
function clearOut() {
    document.game.you.value = "0";
    document.game.computer.value = "0";
    document.game.ties.value = "0";
}

/**
* Функция, которая заполняет оставшеюся позицию исходя
* из того как заполненны две оставшиеся позиции 
* по диагонали, вертикали или горизонтали -  иксом или нулем.
*/
function checkSpace() {
    if ((temp == "A") && (a == 0))    //Заполнение позиции A
    {
        ok = 1;
        if (cf == 0) a = 1;
        if (cf == 1) a = 2;
    }
    if ((temp == "B") && (b == 0))    //Заполнение позиции B
    {
        ok = 1;
        if (cf == 0) b = 1;
        if (cf == 1) b = 2;
    }
    if ((temp == "C") && (c == 0))    //Заполнение позиции C
    {
        ok = 1;
        if (cf == 0) c = 1;
        if (cf == 1) c = 2;
    }
    if ((temp == "D") && (d == 0))    //Заполнение позиции D
    {
        ok = 1;
        if (cf == 0) d = 1;
        if (cf == 1) d = 2;
    }
    if ((temp == "E") && (e == 0))    //Заполнение позиции E
    {
        ok = 1;
        if (cf == 0) e = 1;
        if (cf == 1) e = 2;
    }
    if ((temp == "F") && (f == 0))    //Заполнение позиции F
    {
        ok = 1;
        if (cf == 0) f = 1;
        if (cf == 1) f = 2;
    }
    if ((temp == "G") && (g == 0))    //Заполнение позиции G
    {
        ok = 1;
        if (cf == 0) g = 1;
        if (cf == 1) g = 2;
    }
    if ((temp == "H") && (h ==0 ))    //Заполнение позиции H
    {
        ok = 1;
        if (cf == 0) h = 1;
        if (cf == 1) h = 2;
    }
    if ((temp == "I") && (i == 0))    //Заполнение позиции I
    {
        ok = 1;
        if (cf == 0) i = 1; 
        if (cf == 1) i = 2; 
    }
}

/**
* Функция заполнения позиции пользователем
*
* @param {string} chName Имя позиции
*/
function yourChoice(chName) 
{
    pause = 0;    //Позиция свободна
    if (all != 0) ended();    //Либо пользователь, либо компьютер одержал победу
    if (all == 0)
    {
        cf = 0;
        ok = 0;
        temp = chName;
        checkSpace();
        if (ok == 1)    //Две позиции заполнены, заполням третью
        {
             document.images[chName].src = x;    //Заполнение оставшейся позиции
        }
        if (ok == 0) taken();    //Позиция занята
        process();
        if ((all == 0) && (pause == 0)) myChoice();
    }
}

/**
* Функция, которая предупреждает о невозможности 
* заполнения заполненной клетки
*/
function taken() 
{
    alert("Эта клетка занята!");
    pause = 1;
}

/**
* Функция заполнения позиции компьютером
*/
function myChoice() 
{
    temp = "";
    ok = 0;
    cf = 1;
    logicTwo();
    logicThree();
    checkSpace();
    while(ok == 0) 
    {
        aRandomNumber=Math.random()
        comp = Math.round((choice - 1) * aRandomNumber) + 1;
        if (comp == 1) temp = "A";    //В текущую позицию записывается значение A
        if (comp == 2) temp = "B";    //В текущую позицию записывается значение B
        if (comp == 3) temp = "C";    //В текущую позицию записывается значение C
        if (comp == 4) temp = "D";    //В текущую позицию записывается значение D
        if (comp == 5) temp = "E";    //В текущую позицию записывается значение E
        if (comp == 6) temp = "F";    //В текущую позицию записывается значение F
        if (comp == 7) temp = "G";    //В текущую позицию записывается значение G
        if (comp == 8) temp = "H";    //В текущую позицию записывается значение H
        if (comp == 9) temp = "I";    //В текущую позицию записывается значение I
        checkSpace();
    }
    document.images[temp].src = o;
    process();
}
/**
* Функция конца игры и возможности выбора новой игры
*/
function ended() {
    alert("Игры закончена ! Чтобы сыграть ещё нажмите кнопку (Новая Игра)")
}
/**
* Функция, подводящая итоги игры.
* Выводит на экран сообщение о победе, 
* либо ничье.
*/
function process() {
    logicOne();
    if (all == 1){ alert("Вы выграли!"); wn++; }
    if (all == 2){ alert("Я выиграл!"); ls++; }
    if (all == 3){ alert("Ничья..."); ts++; }
    if (all != 0) {
    document.game.you.value = wn;    //Вы одержали победу
    document.game.computer.value = ls;    //Компьютер одержал победу
    document.game.ties.value = ts;    //Ничья
    }
}

/**
* Функция запуска новой игры
*/
function playAgain() {
    if (all == 0)    //Если победу не успели одержать вы или компьютер
    {
        if(confirm("Вы уверены ?")) reset();
    }
    if (all > 0) reset();    //Если победу успели одержать вы или компьютер
}
/**
* Функция сброса. Обнуляет все значения
*/
function reset() {
    a = 0;
    b = 0;
    c = 0;
    d = 0;
    e = 0;
    f = 0;
    g = 0;
    h = 0;
    i = 0;
    all = 0;
    temp = "";
    ok = 0;
    cf = 0;
    choice = 9;
    aRandomNumber = 0;
    comp = 0;
    //Загрузка изображения blank.img на соответствующую позицию
    document.images.A.src = blank;
    document.images.B.src = blank;
    document.images.C.src = blank;
    document.images.D.src = blank;
    document.images.E.src = blank;
    document.images.F.src = blank;
    document.images.G.src = blank;
    document.images.H.src = blank;
    document.images.I.src = blank;
    if (t == 0) { t = 2; myChoice(); }
    t--;
}
var ie4 = (document.all) ? true : false;
var nn4 = (document.layers) ? true : false;